blog/2013-07-10-in.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>%in% - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="I just stumbled across a really useful infix function in R: %in%. It compares two vectors and returs a logical vector if there is a match or not for &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		<a class="facebook" href="http://www.facebook.com/ronert.obst" title="Facebook">Facebook</a>
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">%in%</h2>
	<div class="entry-content"><p>
I just stumbled across a really useful infix function in R: <code>%in%</code>. It compares two vectors and returs a logical vector if there is a match or not for its left operand. Let us look at some examples:
</p>

<div class="org-src-container">

<pre class="src src-r">&gt; 1:10 %<span style="color: #859900;">in</span>% c(1,3,5,9)
   [1]  <span style="color: #b58900;">TRUE</span> <span style="color: #b58900;">FALSE</span>  <span style="color: #b58900;">TRUE</span> <span style="color: #b58900;">FALSE</span>  <span style="color: #b58900;">TRUE</span> <span style="color: #b58900;">FALSE</span> <span style="color: #b58900;">FALSE</span> <span style="color: #b58900;">FALSE</span>  <span style="color: #b58900;">TRUE</span> <span style="color: #b58900;">FALSE</span>
</pre>
</div>

<p>
\(x\) without \(y\):
</p>

<div class="org-src-container">

<pre class="src src-r">&gt; <span style="color: #268bd2;">"%w/o%"</span> <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #859900;">function</span>(x, y) x[!x %<span style="color: #859900;">in</span>% y]
&gt; (1:10) %w/o% c(3,7,12)
  [1]  1  2  4  5  6  8  9 10
</pre>
</div>

<p>
In my particular use-case, I wanted to implement sampling without replacement in a loop, i.e. removing the sampled values of the previous iteration:
</p>
<div class="org-src-container">

<pre class="src src-r">subsample <span style="color: #268bd2; font-weight: bold;">&lt;-</span> sample(x=observations, size=sample_size)
...
observations <span style="color: #268bd2; font-weight: bold;">&lt;-</span> observations[!observations %<span style="color: #859900;">in</span>% subsample]
</pre>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-07-10T00:00:00+02:00" pubdate data-updated="true">Jul 10<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/r/'>R</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	<a class="addthis_button_facebook_like" fb:like:layout="button_count"></a>
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>